///////////////////////////////////////////////////////////
//
//   トップページ用JS
//   作成者：Comdesign
//   作成日：2018/1/15
//
///////////////////////////////////////////////////////////



//---------------------------------------------------------
// 必要ファイルインポート
//---------------------------------------------------------

//import './_jquery-global.js';
import cmn from './_common.js';
import slick from 'slick-carousel';


//---------------------------------------------------------
// Document ready
//---------------------------------------------------------

$(() => {
	
	var map;
	function initMap() {
		map = new google.maps.Map(document.getElementById('map'), { 
			center: { // 地図の中心を指定
				lat: 34.7019399, // 緯度
				lng: 135.51002519999997 // 経度
			},
			zoom: 19 // 地図のズームを指定
		});
	}
	
});